Repository: CandanUmut/Takvarace
Catalog: lib/l10n/app_*.arb
Languages: tr

# pledgeTitle
source: Intention
tr: Niyet

# pledgeText
source: I intend to avoid the unlawful and to repent and repair if I slip.
tr: Haramdan kaçınmaya, tökezlediğimde tövbe ve telafi etmeye niyet ediyorum.

source: Dashboard
tr: Panel

source: Repentance
tr: Tövbe

source: Diary
tr: Günlük

source: Leaderboard
tr: Sıralama

source: Shields
tr: Kalkanlar

source: Settings
tr: Ayarlar

source: Alias
tr: Rumuz

source: Save
tr: Kaydet

source: Clean Timer
tr: Temiz Süre

# startDay
source: Start the day with intention
tr: Güne niyetle başla

# completeRepentance
source: Complete repentance package
tr: Tövbe paketini tamamla

source: Qur'an
tr: Kur’an

source: Dhikr
tr: Zikir

source: Walk
tr: Yürüyüş

source: Istighfar
tr: İstiğfar

# twoRakah
source: Two Rak'ah Tawbah
tr: İki Rek’at Tövbe

source: Points
tr: Puan

source: Week
tr: Hafta

source: Language
tr: Dil

# onboardingContinue
source: Continue
tr: Devam

# anonymousPledge
source: Your alias and weekly score are shared anonymously. Everything else stays on this device.
tr: Sadece rumuzun ve haftalık puanın anonim şekilde paylaşılır. Diğer her şey bu cihazda kalır.

# createAlias
source: Choose an alias
tr: Bir rumuz seç

# aliasHint
source: 3–24 characters, no spaces
tr: 3–24 karakter, boşluk yok

# intentionPledge
source: Make your intention
tr: Niyetini tazele

source: Start tracking
tr: Takibi başlat

# onboardingWelcomeTitle
source: Welcome to your companion
tr: Yoldaşına hoş geldin

# onboardingWelcomeDescription
source: Craft a guided journey that keeps your intentions alive every day.
tr: Niyetini her gün canlı tutacak rehberli bir yolculuk oluştur.

# onboardingSkip
source: Skip
tr: Atla

# onboardingBack
source: Back
tr: Geri

# onboardingNext
source: Next
tr: İleri

# onboardingFocusTitle
source: Choose what you want to nurture
tr: Geliştirmek istediğin alanları seç

# onboardingFocusDescription
source: Select a few focus areas so we can tailor prompts, quick actions, and reflections for you.
tr: Uyarıları, hızlı eklemeleri ve tefekkürleri sana göre uyarlayabilmemiz için birkaç odak alanı seç.

# companionContentSubtitle
source: Takva keeps you supported with curated guidance.
tr: Takva seni seçilmiş rehberliklerle destekler.

# onboardingWelcomeCard1Title
source: Personalised daily rhythm
tr: Kişisel günlük ritim

# onboardingWelcomeCard1Body
source: Highlights, quick adds, and guided prompts adapt to your goals.
tr: Öne çıkanlar, hızlı eklemeler ve rehberli istemler hedeflerine göre şekillenir.

# onboardingWelcomeCard2Title
source: Meaningful accountability
tr: Anlamlı muhasebe

# onboardingWelcomeCard2Body
source: Track intentions, repent swiftly, and celebrate steady progress.
tr: Niyetini takip et, hızlıca tövbe et ve istikrarlı ilerleyişini kutla.

# onboardingProfileTitle
source: Set your profile
tr: Profilini ayarla

# onboardingProfileDescription
source: Language, alias, and sharing preferences shape the experience across the app.
tr: Dil, rumuz ve paylaşım tercihlerin uygulama deneyimini şekillendirir.

# onboardingDailyIntentionLabel
source: Daily intention or guiding phrase
tr: Günlük niyet veya yönlendirici söz

# onboardingDailyIntentionHint
source: E.g. Stay mindful with every prayer, serve with gratitude.
tr: Örn. Her namazda bilinçli kal, şükürle hizmet et.

# onboardingFocusPrayer
source: Prayer discipline
tr: Namaz disiplini

# onboardingFocusQuran
source: Qur'an connection
tr: Kur’an bağı

# onboardingFocusWellbeing
source: Wellbeing & balance
tr: İyi oluş ve denge

# onboardingFocusCharity
source: Charity & service
tr: Sadaka ve hizmet

# onboardingFocusKnowledge
source: Knowledge growth
tr: İlimde ilerleme

source: Add entry
tr: Kayıt ekle

# freeTextPlaceholder
source: E.g. Read 2 pages Qur'an, 15m walk, evening dhikr 33x
tr: Örn. 2 sayfa Kur’an okudum, 15dk yürüyüş, akşam zikri 33x

source: Parse
tr: Çözümle

# parsedEntries
source: Recognized deeds
tr: Tanımlanan ameller

# unknownEntries
source: Suggestions
tr: Öneriler

source: Repentance Flow
tr: Tövbe Akışı

source: Step
tr: Adım

source: Finish
tr: Bitir

source: Cancel
tr: İptal

source: Weekly score
tr: Haftalık puan

# shareScore
source: Share score anonymously
tr: Puanı anonim paylaş

# noLeaderboard
source: Leaderboard hidden
tr: Sıralama gizli

# leaderboardEmpty
source: No companions on the board yet this week.
tr: Bu hafta henüz kimse listede değil.

# leaderboardEmptyHint
source: Entries appear once someone shares their score again.
tr: Birisi puanını yeniden paylaştığında kayıtlar görünecek.

source: Loading...
tr: Yükleniyor...

source: Last fall
tr: Son düşüş

source: Streak
tr: Seri

source: days
tr: gün

source: hours
tr: saat

source: minutes
tr: dakika

source: Export diary
tr: Günlüğü dışa aktar

source: Import diary
tr: Günlüğü içe aktar

# diaryEmpty
source: Diary is empty
tr: Günlük boş

source: Repentance multiplier
tr: Tövbe çarpanı

source: Shield guides
tr: Kalkan rehberleri

# enableShield
source: Enable shield reminder
tr: Kalkan hatırlatıcısını aç

source: Tasbih counter
tr: Tesbih sayacı

source: Breathing aid
tr: Nefes egzersizi

# trend
source: Weekly trend
tr: Haftalık trend

# privacyMode
source: Private mode
tr: Mahremiyet modu

source: Enable
tr: Aç

source: Disable
tr: Kapat

# entryTitle
source: Title
tr: Başlık

# entryContent
source: Notes
tr: Notlar

source: Tags
tr: Etiketler

# companionGreeting
source: Assalamu alaikum
tr: Esselamu aleykum

# companionSubtitle
source: Let's make today purposeful with mindful actions and sincere repentance.
tr: Bugünü şuurlu ameller ve ihlaslı tövbelerle anlamlı kılalım.

# companionScoreError
source: Unable to load your weekly score right now.
tr: Haftalık puan şu anda yüklenemedi.

# companionIntentionTitle
source: Today's guiding intention
tr: Bugünün yönlendirici niyeti

# companionIntentionFallback
source: Set an intention during onboarding to keep your focus front and centre.
tr: Odak alanını öne çıkarmak için onboarding sırasında bir niyet belirle.

# companionFocusHeader
source: Focus areas
tr: Odak alanları

# companionFocusEmpty
source: Choose a focus during onboarding to unlock tailored tips.
tr: Özgün tavsiyeler için onboarding’de bir odak seç.

# companionContentTitle
source: Daily highlights
tr: Günün öne çıkanları

# companionCardMindfulTitle
source: Mindful start
tr: Farkındalıkla başla

# companionCardMindfulBody
source: Begin with three slow breaths and recall why you chose this journey.
tr: Üç derin nefes al ve bu yolculuğu neden seçtiğini hatırla.

# companionCardGratitudeTitle
source: Reflection cue
tr: Tefekkür önerisi

# companionCardGratitudeBody
source: Note one blessing tied to your current focus area before the day ends.
tr: Gün bitmeden odak alanınla ilgili bir nimeti not et.

# companionCardServiceTitle
source: Small service idea
tr: Küçük hizmet fikri

# companionCardServiceBody
source: Offer a kind word, check on a friend, or share knowledge relevant to your focus.
tr: Nazik bir söz söyle, bir dostu yokla veya odağına uygun faydalı bir bilgi paylaş.

# companionQuickActionsTitle
source: Quick add
tr: Hızlı ekle

# companionQuickAdd
source: Logged
tr: Kaydedildi

# companionGuidedPrompts
source: Guided prompts
tr: Rehberli istemler

# companionGuidedPromptReflect
source: Reflect on a recent win and what enabled it.
tr: Son bir başarını ve buna vesile olan sebebi düşün.

# companionGuidedPromptGratitude
source: Write a gratitude note connected to today's intention.
tr: Bugünkü niyetine bağlı bir şükür notu yaz.

# companionGuidedPromptPlan
source: Plan one concrete action for your focus area.
tr: Odak alanın için somut bir adım planla.

# companionEntryHelperTitle
source: Add a detailed entry
tr: Detaylı kayıt ekle

# companionEntryHelperSubtitle
source: Describe your deeds naturally—we'll parse and assign points for you.
tr: Amellerini doğal biçimde yaz, biz çözümler ve puanları veririz.

# companionFocusTipPrayer
source: Anchor your prayers on time. Pair the adhan with a brief intention reset before you stand.
tr: Namazlarını vaktinde kıl; ezanla birlikte kısa bir niyet tazelemesi yap.

# companionFocusTipQuran
source: Set a consistent recitation slot—morning light or after prayer—to deepen your Qur'an connection.
tr: Kur’an tilaveti için sabah serinliği veya namaz sonrası gibi düzenli bir zaman ayır.

# companionFocusTipWellbeing
source: Balance your energy with restorative breaks and a short walk to refresh your state.
tr: Enerjini dengelemek için yenileyici molalar ver ve kısa bir yürüyüşle tazelen.

# companionFocusTipCharity
source: Look for micro-moments to serve—support a neighbour or share a beneficial reminder.
tr: Hizmet fırsatları ara; bir komşuyu gözet veya faydalı bir hatırlatma paylaş.

# companionFocusTipKnowledge
source: Dedicate focused minutes to studying and summarise one insight to revisit later.
tr: Ders çalışmaya odaklı dakikalar ayır ve sonra tekrar etmek için bir içgörü not et.

# dashboardTabOverview
source: Daily flow
tr: Günlük akış

# dashboardTabFocus
source: Focus lab
tr: Odak atölyesi

# dashboardGoalTitle
source: Choose today's vibe
tr: Bugünün ruhunu seç

# dashboardGoalDescription
source: Switch goals to tune how your dashboard nudges and celebrates you.
tr: Hedefi değiştirerek paneldeki yönlendirme ve kutlamaları ayarlayabilirsin.

# dashboardGoalSteadyTitle
source: Steady momentum
tr: İstikrarlı tempo

# dashboardGoalSteadySubtitle
source: A balanced cadence to stay consistent all week.
tr: Hafta boyunca dengeli kalmak için ideal.

# dashboardGoalGrowthTitle
source: Growth sprint
tr: Gelişim atağı

# dashboardGoalGrowthSubtitle
source: Amp up your rhythm and chase a bold target.
tr: Ritmini yükselt ve iddialı bir hedef kovala.

# dashboardGoalReflectTitle
source: Gentle reflection
tr: Yumuşak tefekkür

# dashboardGoalReflectSubtitle
source: Keep things light while protecting your habits.
tr: Alışkanlıklarını korurken hafif ilerle.

# dashboardWeeklyProgressLabel
source: Weekly points
tr: Haftalık puan

# dashboardWeeklyProgressHint
source: {points} points to reach this goal
tr: Hedefe {points} puan kaldı

# dashboardWeeklyProgressComplete
source: Beautiful consistency—you're meeting this intention!
tr: Harika istikrar—bu niyeti yerine getiriyorsun!

# dashboardPomodoroFocusComplete
source: Focus session complete. Take a mindful breath before your break.
tr: Odak seansı bitti. Moladan önce bilinçli bir nefes al.

# dashboardPomodoroBreakComplete
source: Break wrapped up. When you're ready, dive back into focus.
tr: Mola tamamlandı. Hazırsan yeniden odaklan.

# dashboardZikrCountLabel
source: Count:
tr: Sayı:

# dashboardZikrGoalLabel
source: Goal:
tr: Hedef:

# dashboardZikrReset
source: Reset
tr: Sıfırla

# dashboardZikrAddOne
source: Add 1
tr: 1 ekle

# dashboardZikrRemove
source: Remove
tr: Çıkar

# dashboardZikrAddTen
source: Add 10
tr: 10 ekle

# dashboardZikrCustomize
source: Personalise zikr
tr: Zikri kişiselleştir

# dashboardZikrPhrase
source: Phrase
tr: Cümle

# dashboardZikrInvalidGoal
source: Please enter a valid goal.
tr: Lütfen geçerli bir hedef gir.

# dashboardPomodoroFocus
source: Focus session
tr: Odak seansı

# dashboardPomodoroRest
source: Break session
tr: Mola seansı

# dashboardPomodoroReset
source: Reset timer
tr: Zamanlayıcıyı sıfırla

# dashboardPomodoroRunning
source: In progress
tr: Devam ediyor

# dashboardPomodoroReady
source: Ready
tr: Hazır

# dashboardPomodoroPause
source: Pause
tr: Duraklat

# dashboardPomodoroStart
source: Start
tr: Başlat

# dashboardPomodoroSwitchToBreak
source: Switch to break
tr: Molaya geç

# dashboardPomodoroBackToFocus
source: Back to focus
tr: Odaka dön

# dashboardPomodoroCompleted
source: Completed focus rounds: {count}
tr: Tamamlanan odak turları: {count}

# dashboardPomodoroFocusLength
source: Focus length
tr: Odak süresi

# dashboardPomodoroBreakLength
source: Break length
tr: Mola süresi
